{
    "signupTitle":"Luo käyttäjätunnus",
    "emailTaken": "Sähköpostiosoitteesi on jo käytössä. Oletko tehnyt aikaisemmin mooc.fi:n kursseja?",
    "commonProblem":"Ongelma tunnuksen luonnissa. Virhe oli: ",
    "emailNoAt":"Sähköpostiosoitteessa ei ole '@'-merkkiä. ",
    "emailNoPoint":"Sähköpostiosoitessa ei ole '.'-merkkiä. ",
    "passwordNoMatch":"Salasana ja salasana uudestaan eivät olleet samoja. ",
    "researchNotAnswered": "Valitse osallistutko tutkimukseen. ",
    "formLabelEmail":"Sähköpostiosoite",
    "formLabelFirstName":"Etunimi",
    "formLabelLastName":"Sukunimi",
    "formLabelPassword": "Salasana",
    "formLabelPasswordAgain":"Salasana uudestaan",
    "formInfoText":"Tällä sivulla voit luoda uuden tunnuksen, joka toimii suurimmassa osassa mooc.fi:n kursseissa ja palveluissa. Jos olet aikaisemmin tehnyt mooc.fi -kursseja, voit käyttää sisäänkirjautumissivulla olemassaolevia tunnuksiasi.",
    "error": "Virhe: ",
    "researchTitle":"Kursseilla tehtävästä tutkimuksesta",
    "research1":" Kursseilla tehdään oppimiseen liittyvää tutkimusta. Tällä tutkimuksella on useampia tavoitteita:",
    "research2":"kehittää kurssien oppimateriaaleja niin, että ne ottaisivat yksilölliset erot huomioon ja reagoisivat tarvittaessa tarjoten kohdennetumpaa oppisisältöä",
    "research3":"edistää digitaalisissa ympäristöissä tapahtuvaan oppimiseen liittyvää ymmärrystä ja tietoa, sekä",
    "research4":"tukea tutkimustiedon kautta muita oppimateriaalien kehittäjiä ja oppimisen tutkijoita. Tämä johtaa luonnollisesti myös parempaan oppimiskokemukseen opiskelijoille.",
    "research5":"Tällaisesta oppimisanalytiikaksi kutsutusta tutkimuksesta kiinnostuneiden kannattaa tutustua esimerkiksi artikkeliin ",
    "research6":"Tutkimuksesta vastaa Helsingin yliopiston tietojenkäsittelytieteen laitoksen Agile Education Research -ryhmän Matti Luukkainen. Voit pyytää milloin tahansa sinusta kerätyn datan poistamista lähettämällä sähköpostin osoitteeseen mooc@cs.helsinki.fi",
    "research7":"Työskentelystä kerättyä tietoa käytetään tutkimuksessa. Kerätty tieto sisältää tietoa oppimateriaalien käytöstä, kurssitehtävien tekemisestä sekä kokeissa pärjäämisestä. Tutkimustuloksista ei pystytä tunnistamaan yksittäisiä opiskelijoita. Osallistuminen on vapaaehtoista, ja jos et osallistu tutkimukseen, siitä ei tule minkäänlaisia seuraamuksia.",
    "researchAgree": "Tutkimukseen osallistuminen",
    "researchYes": "Osallistun oppimiseen liittyvään tutkimukseen. Valitsemalla tämän autat sekä nykyisiä että tulevia opiskelijoita.",
    "researchNo": "En osallistu oppimiseen liittyvään tutkimukseen.",    
    "signIn": "Onko sinulla jo käyttäjätunnus? Kirjaudu sisään",
    "confirmEmailTitle": "Mooc.fi käyttäjätunnuksesi on luotu",
    "confirmEmailInfo": "Olemme lähettäneet sähköpostiisi sähköpostiosoitteen varmistuslinkin. Käy nyt sähköpostissasi ja varmista osoitteesi."
}