{
    "siteTitle": "MOOC.fi Opettajille",
    "siteIntro": " Ohjelmointitaito korostuu jatkuvasti nykyajan maailmassa ja opetuksessa. Avustamme kaikkia kiinnostuneita kouluja järjestämään ohjelmoinnin perusopetusta. Tarjoamme käyttöösi kaiken kurssilla tarvittavan materiaalin aina koekysymyksiin asti. Sinun ei edes tarvitse huolehtia tehtävistä tai tentistä: tehtävät tarkastetaan automaattisesti ja Helsingin yliopisto tarjoaa halutessasi kokeet ilmaisina verkkotentteinä.",
    "teachingTitle": "MOOCin käyttö opetuksessa",
    "teachingText": "Voit hyödyntää suurinta osaa tarjoamistamme materiaaleista vapaasti. Materiaaleissamme on lähes poikkeuksetta käytetty <a href=\"https://creativecommons.org/licenses/by-nc-sa/4.0/deed.en\">Creative Commons BY-NC-SA <a \/>  -lisenssiä, mutta tarkista vielä lisenssi materiaalista. Creative Commons BY-NC-SA -lisenssi tarkoittaa sitä, että voit käyttää materiaaleja joko sellaisenaan tai muokata niitä paremmin omaan opetukseesi sopivaksi, kunhan säilytät tiedon alkuperäisistä tekijöistä materiaalissa ja et tavoittele materiaaleillamme itsellesi kaupallista hyötyä. ",
    "teachingText2":"Mikäli tarkoituksesi on järjestää ohjelmoinnin perusteiden opetusta, kurssikokonaisuutemme sopii siihen erinomaisesti. Tarjolla on laadukas opetusmateriaali, joka 'opettaa itse itseään', sekä erittäin kattavat harjoitustehtäväsarjat, jotka järjestelmämme tarkastaa automaattisesti mihin tahansa kellonaikaan. Jos haluat omaan oppilaitokseesi kurssejamme, joilla on omaan opetukseesi sopivat määräajat, onnistuu se toistaiseksi maksutta. Olemme kehittämässä prosessia jatkuvasti. Oman ohjelmointikurssin pitäminen ei ole koskaan ollut näin helppoa! ",
    "teachingText3":"MOOCit ovat muutenkin erittäin kätevä apuväline opettajille. Kaikkiin kursseihin kuuluva automaattinen tehtävien tarkastus vapauttaa aikaa opettajalta opettamiseen ja opiskelijoiden henkilökohtaiseen ohjaamiseen.",
    "organizeTitle": "Näin järjestät kurssin",
    "organizeText":"Mikäli opiskelijasi haluavat hakea Ohjelmoinnin MOOC -kurssin kautta opiskelupaikkaa Helsingin yliopiston tietojenkäsittelyn laitokselle, tulee heidän osallistua juuri kyseenomaiselle  keväisin järjestettävälle aikataulutetulle opiskeluoikeiden mahdollistavalle kurssille. Muissa tapauksissa suosittelemme oman kurssi-instanssin luomista, jolloin opettajana sinun on helpompaa ja vaivattomampaa seurata kurssilaistesi etenemistä, sekä voit asettaa kurssille omat määräajat.",
    "organizeText2":"Tarjoamme kursseistamme valmiita kurssipaketteja, joista voit luoda omaan käyttöösi, sinulle sopivilla määräajoilla, oman kurssin. Kurssipakettiin kuuluu siis tehtävät ja erityisesti näille tehtäville tarkoitettu opetusmateriaali. Kurssin materiaali on avoimesti kaikkien luettavissa netissä, mutta kurssin tehtäviä tehdäkseen tulee opiskelijan kirjautua järjestelmään ja rekisteröityä kurssillesi.",
    "organizeText3":"Opettajana näet tehtävät malliratkaisuineen, sekä kaikkien kurssilaisten kaikki palautukset ja pisteet. Voit myös hallita kurssien tehtävien avautumista ja sulkeutumista omien tarpeidesi mukaan.",
    "tmcTitle":"Test My Code (TMC)",
    "tmcText":"Test My Code (TMC) on järjestelmä, joka huolehtii tehtävien automaattisesta tarkastuksesta ja pisteytyksestä. Opettajille se mahdollistaa omalle koululleen oman organisaation ja kurssien luomisen. Organisaatio ja omat kurssit on tarkoitettu helpottamaan omien opiskelijoiden seurantaa ja yksilöllistä tehtävien aikatauluttamista. ",
    "tmcText2":"Luotuasi organisaation, voit antaa myös muille koulusi opettajille oikeudet hallinnoida organisaatiota. Voit myös kurssikohtaisesti antaa apuopettajan statuksen.",
    "howtoTitle":"Kurssin perustaminen",
    "howtoText":"Aloita luomalla itsellesi käyttäjätunnus sivustolle <a href=\"https://tmc.mooc.fi/\">https://tmc.mooc.fi/</a> Varmista ettei oppilaitoksellesi ole jo luotu organisaatiota. Mikäli oppilaitoksellasi on jo organisaatio, pyydä jotakuta organisaation opettajaa lisäämään sinut opettajaksi. Pyrimme välttämään tilannetta jossa esimerkiksi samalla lukiolla on järjestelmässä useita eri organisaatioita. ",
    "howtoText2":"Seuraa Test My Coden opettajan opasta koulusi organisaation luomiseen ja ensimmäisen kurssin rakentamiseen. Huom: opas on tällä hetkellä tarjolla vain englanniksi.",
    "tmcButtonText":"TMC Opas opettajille",
    "howtoNB":"<b>Huom</b>: organisaatio luodaan järjestelmään välittömästi, joten voit heti organisaation luomisen jälkeen lisätä sen alle kursseja. Et kuitenkaan näe tehtävien mallivastauksia ennen kuin järjestelmänvalvoja varmistaa organisaatiosi. Järjestelyn tarkoitus on estää organisaatioiden luominen mallivastausten lunttaamiseksi. Organisaatiot hyväksytään yleensä seuraavana arkipäivänä mikäli olet käyttänyt instituutiosi sähköpostiosoitetta. Mikäli hyväksyminen kestää, ota yhteyttä sähköpostiosoitteeseemme, jonka löydät mm. tämän sivun alareunasta.",
    "teachingTipsTitle":"Vinkkejä lähiopetukseen",
    "teachingTips":"Ohjelmointia oppii parhaiten tekemällä, ja siksi tärkeintä onkin että opiskelijat pääsevät itse ohjelmoimaan mahdollisimman paljon. Olemme huomanneet että opiskelijat oppivat klassista luentoa paremmin ns. 'pajaopetuksessa', missä kurssin asiat jo hallitsevat henkilöt kiertelevät ATK-luokassa tarjoten apua opiskelijoille jotka tekevät muuten itsenäisesti tehtäviä. Tekniikasta käytetään myös nimeä 'tehostettu kisällioppiminen' ja siitä on julkaistu useita artikkeleita.",
    "teachingTips2":"Myös luento-tyyppinen opetus on toki hyödyllistä. Luennolla ei kuitenkaan kannattane tehdä suoraan samoja tehtäviä kuin mitä opiskelijat tekevät viikon aikana, vaan näyttää lyhyitä esimerkkejä viikon konsepteista. Olemme huomanneet että luennollakin on usein hyödyllistä käyttää suurin osa ajasta näyttäen opettajan ohjelmointia esim. videotykin kautta.  ",
    "teachingTips3":"Tärkeää on myös huomata että on jopa hyödyllistä jos opiskelija näkee opettajan tekevän ohjelmointivirheitä. Opiskelija näkee että virheet ovat arkea, ja ettei kukaan luo heti täydellistä koodia. Lisäksi opiskelija oppii samalla kuinka virheitä tunnistetaan ja korjataan. ",
    "2016Title":"Opetussuunnitelma 2016",
    "2016Text":"Lähivuosina kaikki opettelevat ohjelmointia peruskoulusta asti. Tämä vaatii opettajilta ohjelmointiosaamista. Suosittelemme opettajille opetuksen tueksi erityisesti <a href=\"http://koodiaapinen.fi/\"> Koodiaapista </a>. Koodiaapinen kerää ja tarjoaa opettajille suunnattuja  resursseja, jotka auttavat ohjelmointiopetuksen järjestämisessä. Voit osallistua koodiaapisen luomiseen myös itse.",
    "contactTitle":"Ota yhteyttä",
    "contactText":"Saat meihin parhaiten yhteyden lähettämällä sähköpostia osoitteeseen <a href=\"mailto:mooc@cs.helsinki.fi\">mooc@cs.helsinki.fi</a>"
}