{
    "login": "Log in with your mooc.fi account",
    "loginShort": "Log in",
    "signUp": "Sign up",
    "logout": "Log out",
    "loginDetails": "Already registered for a course? Login with the details you used to register for a course.",
    "profile": "My profile",
    "forgottenpw": "Forgot your password?",
    "error": "Login failed. Wrong password or email address/username",
    "password": "Password",
    "username": "Email or username",
    "skiplink": "To main content",
    "errorTitle": "An error has occured",
    "loadMore": "Load more",
    "confirmationUnsavedChanges": "You have unsaved changes",
    "confirmationLeaveWithoutSaving": "Are you sure you want to leave without saving?",
    "confirmationAboutToDelete": "About to delete",
    "confirmationDelete": "Are you sure you want to delete?",
    "confirmationYes": "Yes",
    "confirmationNo": "No",
    "showDelete": "Check this to show delete button",
    "delete": "Delete",
    "save": "Save",
    "cancel": "Cancel",
    "submittingError": "Error submitting: ",
    "imageDropMessage": "Drop image or click to select",
    "imageNotAnImage": "That was not an image!",
    "imageNotAcceptableFormat": "Not an acceptable format",
    "imageDropHere": "Drop image file here",
    "courses": "Courses",
    "modules": "Modules",
    "userSearch": "User Search",
    "emailTemplates": "Email Templates",
    "adminError": "Looks like you are trying to view an Admin only page. If you think you should have access to this page, log in again using your admin details.",
    "adminSorry": "Sorry...",
    "researchTitle": "Regarding research done on courses",
    "research1": "Educational research is conducted on the courses. This research has multiple goals: ",
    "research2": "to develop learning materials so that they take individual differences in learning into account and can individualize content in the material based on the learner,",
    "research3": "advance knowledge and understanding about learning in online learning environments, and",
    "research4": "provide research-based support to other learning material developers and educational researchers, which will lead into a better learning experience for students. ",
    "research5": "This field of research is called learning analytics, and those interested in learning more about it are encouraged to read an article that provides an overview of the area called ",
    "research6": "Matti Luukkainen from the Agile Education Research group at the Deparment of Computer Science at the University of Helsinki is responsible for the research. You can request the deletion of data related to you at any time by sending an email to mooc@cs.helsinki.fi",
    "research7": "Data from the learning process is used in this research. The data includes information about learning material usage, course assignment progress and completion, and exam performance. Individual students cannot be identified from the results. Participation is voluntary, and if you do not wish to participate in the research, there are no consequences to you.",
    "researchAgree": "Taking part on the research",
    "researchYes": "I want to participate in the educational research. By choosing this, you help both current and future students.",
    "researchNo": "I do not want to participate in the educational research.",
    "editorRevert": "Revert changes",
    "selectNoChoice": "(no choice)",
    "showHidden": "Show hidden",
    "Active": "Active",
    "Upcoming": "Upcoming",
    "Ended": "Ended",
    "handledBy": "Handled by",
    "search": "Search...",
    "reset": "Reset",
    "showAll": "Show all",
    "hideAll": "Hide all",
    "authConsent": "Allow this application to login with your MOOC account?",
    "allow": "Allow",
    "deny": "Deny"
}